#define _CRT_SECURE_NO_WARNINGS 

// 
//	Linux中安装文件：
// 1.源码安装（不推荐）
// 2.软件包安装 --- rpm（软件之间存在依赖，可能存在依赖缺失的问题）（还有软件兼容性的问题）
// 
// 3.包管理器：yum(centos)、apt/apt-get(ubuntu)（自动解决包的依赖问题）（推荐）
// a.网络下载
// b.安装软件（就是拷贝）->（拷贝到各个系统文件夹中）->（所以必须使用root权限）
// ->（因为各个系统文件夹的other权限为r-x）->（所以安装软件后各个用户均可使用）
// 
//	什么是包管理器？
// 类似于手机上的应用商店
// 
//	如何评价一款操作系统的好坏？
// a.内核版本
// b.生态：社区、文档、人群、问题、配套软件...
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 



// 
// (sudo) yum install 软件名
// (sudo) yum -y install 软件名
// 
// ping 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 





