#define _CRT_SECURE_NO_WARNINGS 

// 目录 == 文件夹
// 命令 + 命令行选项（0个或多个，空格隔开）
// 命令其实就是文件
// 命令 == 可执行文件 == (C/C++)程序
// 文件(大小) == 内容 + 属性（所以空文件也占磁盘空间）
// 
// 区分目录（不靠前缀）
// 看第一个字母/字符
// 目录
// 一般文件
// 
// 隐藏 文件/目录
// .
// ..
// 空目录也有
// 
// 路径分隔符
// win：  \ 
// Liunx：/
// 开头的 / 不是分隔符，是Linux根目录
// Linux文件结构：从根目录开始的多叉树
// a.叶子节点：
// b.非叶子节点：
// 
// 绝对路径：从/定位文件位置
// 相对路径：从非/为参照定位
// 使用场景
// 
// ctrl + c (^C) 终止当前进程
// 上下↑↓      寻找历史命令
// Alt + Enter   全屏/退出全屏

// whoami
// pwd 
// cd 
// cd ~
// cd -
// 
// mkdir
// mkdir -p
// rmdir
// rm
// rm -f
// rm -r
// 
// touch
// stat
// 
// ls
// ls -l
// 默认，指定
// ls -d
// ls -a
// ls -l -a == ls -al
// ls -lad
// ll
// 
// cp
// cp -r
// 
// tree
// tree .
// tree ..
// tree ~
// 
// alias
// 
// *
// 
// man
//
